Tekla Open API Reference for Tekla Structures 2025
DetailMarkTagsAttributes Constructor
Overload List
Name | Description
DetailMarkTagsAttributes()
 Creates a new mark tags attributes instance.
DetailMarkTagsAttributes(ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes)
 Creates a new mark tags attributes instance.
Top
See Also
Reference
DetailMarkTagsAttributes Class
Tekla.Structures.Drawing Namespace